Repository: John-Donnelly/SmrtPad
Catalog: SmrtPad/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, de_de, es_es, fr_fr, ja_jp, ru_ru, ur_pk

# BackstagePageSetupDesc
source: Configure paper size, orientation, and margins for page view and printing.
ar_sa: تكوين حجم الورق، الاتجاه، والهوامش لعرض الصفحة والطباعة.
de_de: Papiergröße, Ausrichtung und Ränder für die Seitenansicht und den Druck konfigurieren.
es_es: Configurar tamaño de papel, orientación y márgenes para la vista de página y la impresión.
fr_fr: Configurer la taille du papier, l'orientation et les marges pour l'affichage et l'impression de la page.
ja_jp: ページビューと印刷のための用紙サイズ、向き、余白を設定します。
ru_ru: Настройте размер бумаги, ориентацию и поля для просмотра страницы и печати.
ur_pk: صفحہ منظر اور پرنٹنگ کے لیے کاغذ کا سائز، سمت، اور مارجن ترتیب دیں۔

# PageSetupTitle
source: Page Setup
ar_sa: إعداد الصفحة
de_de: Seitenlayout
es_es: Configuración de página
fr_fr: Configuration de la page
ja_jp: ページ設定
ru_ru: Настройка страницы
ur_pk: صفحہ ترتیب

# PageSetupPaperSize
source: Paper size
ar_sa: حجم الورق
de_de: Papiergröße
es_es: Tamaño de papel
fr_fr: Taille du papier
ja_jp: 用紙サイズ
ru_ru: Размер бумаги
ur_pk: کاغذ کا سائز

# PageSetupPaperLetter
source: Letter
ar_sa: خطاب
es_es: Carta
fr_fr: Lettre
ja_jp: レター
ru_ru: Письмо
ur_pk: خط

# PageSetupPaperLegal
source: Legal
ar_sa: قانوني
fr_fr: Légal
ja_jp: リーガル
ru_ru: Юридический
ur_pk: قانونی

# PageSetupOrientation
source: Orientation
ar_sa: الاتجاه
de_de: Ausrichtung
es_es: Orientación
ja_jp: 向き
ru_ru: Ориентация
ur_pk: سمت

# PageSetupOrientationPortrait
source: Portrait
ar_sa: عمودي
de_de: Hochformat
es_es: Vertical
ja_jp: 縦
ru_ru: Портретная
ur_pk: عمودی

# PageSetupOrientationLandscape
source: Landscape
ar_sa: أفقي
de_de: Querformat
es_es: Horizontal
fr_fr: Paysage
ja_jp: 横
ru_ru: Ландшафтная
ur_pk: افقی

# PageSetupMarginTop
source: Top margin (in)
ar_sa: الهامش العلوي (بوصة)
de_de: Obere Marge (in)
es_es: Margen superior (pulgadas)
fr_fr: Marges supérieures (po)
ja_jp: 上余白 (インチ)
ru_ru: Верхнее поле (дюймы)
ur_pk: اوپر کا مارجن (انچ)

# PageSetupMarginBottom
source: Bottom margin (in)
ar_sa: الهامش السفلي (بوصة)
de_de: Untere Marge (in)
es_es: Margen inferior (pulgadas)
fr_fr: Marges inférieures (po)
ja_jp: 下余白 (インチ)
ru_ru: Нижнее поле (дюймы)
ur_pk: نیچے کا مارجن (انچ)

# PageSetupMarginLeft
source: Left margin (in)
ar_sa: الهامش الأيسر (بوصة)
de_de: Linke Marge (in)
es_es: Margen izquierdo (pulgadas)
fr_fr: Marges gauche (po)
ja_jp: 左余白 (インチ)
ru_ru: Левое поле (дюймы)
ur_pk: بائیں مارجن (انچ)

# PageSetupMarginRight
source: Right margin (in)
ar_sa: الهامش الأيمن (بوصة)
de_de: Rechte Marge (in)
es_es: Margen derecho (pulgadas)
fr_fr: Marges droite (po)
ja_jp: 右余白 (インチ)
ru_ru: Правое поле (дюймы)
ur_pk: دائیں مارجن (انچ)

# StatusPageSetupSaved
source: Page setup saved.
ar_sa: تم حفظ إعداد الصفحة.
de_de: Seitenlayout gespeichert.
es_es: Configuración de página guardada.
fr_fr: Configuration de la page enregistrée.
ja_jp: ページ設定が保存されました。
ru_ru: Настройка страницы сохранена.
ur_pk: صفحہ ترتیب محفوظ کر لی گئی۔

# MacroRecord
source: Record Macro
ar_sa: تسجيل ماكرو
de_de: Makro aufzeichnen
es_es: Grabar macro
fr_fr: Enregistrer une macro
ja_jp: マクロの記録
ru_ru: Записать макрос
ur_pk: میکرو ریکارڈ کریں

# ErrorExportingDocx
source: Error Exporting Document
ar_sa: خطأ في تصدير المستند
de_de: Fehler beim Dokumentexport
es_es: Error al exportar documento
fr_fr: Erreur lors de l'export du document
ja_jp: ドキュメントエクスポートエラー
ru_ru: Ошибка экспорта документа
ur_pk: دستاویز برآمد کرنے میں خرابی

# SpellCheckToggle.Text
source: Spell Check
ar_sa: التدقيق الإملائي
de_de: Rechtschreibprüfung
es_es: Corrección ortográfica
fr_fr: Vérification orthographique
ja_jp: スペルチェック
ru_ru: Проверка орфографии
ur_pk: ہجے کی جانچ

# OneDriveNavItem.Content
source: Save to OneDrive
ar_sa: حفظ في OneDrive
de_de: In OneDrive speichern
es_es: Guardar en OneDrive
fr_fr: Enregistrer dans OneDrive
ja_jp: OneDriveに保存
ru_ru: Сохранить в OneDrive
ur_pk: OneDrive میں محفوظ کریں

# MacroStop
source: Stop Recording
ar_sa: إيقاف التسجيل
de_de: Aufzeichnung beenden
es_es: Detener grabación
fr_fr: Arrêter l'enregistrement
ja_jp: 記録を停止
ru_ru: Остановить запись
ur_pk: ریکارڈنگ بند کریں

# BackstageExportDocxDesc
source: Export the current document as a Word DOCX file.
ar_sa: تصدير المستند الحالي كملف Word DOCX.
de_de: Das aktuelle Dokument als Word-DOCX-Datei exportieren.
es_es: Exportar el documento actual como archivo Word DOCX.
fr_fr: Exporter le document actuel sous forme de fichier Word DOCX.
ja_jp: 現在のドキュメントをWord DOCXファイルとしてエクスポートします。
ru_ru: Экспортировать текущий документ как файл Word DOCX.
ur_pk: موجودہ دستاویز کو Word DOCX فائل کے طور پر برآمد کریں۔

# StatusNewTab
source: New tab created.
ar_sa: تم إنشاء علامة تبويب جديدة.
de_de: Neue Registerkarte erstellt.
es_es: Nueva pestaña creada.
fr_fr: Nouvel onglet créé.
ja_jp: 新しいタブを作成しました。
ru_ru: Новая вкладка создана.
ur_pk: نیا ٹیب بنایا گیا۔

# BackstageExportPdfDesc
source: Export the current document as a PDF file.
ar_sa: تصدير المستند الحالي كملف PDF.
de_de: Das aktuelle Dokument als PDF-Datei exportieren.
es_es: Exportar el documento actual como archivo PDF.
fr_fr: Exporter le document actuel sous forme de fichier PDF.
ja_jp: 現在のドキュメントをPDFファイルとしてエクスポートします。
ru_ru: Экспортировать текущий документ как файл PDF.
ur_pk: موجودہ دستاویز کو PDF فائل کے طور پر برآمد کریں۔

# ExportDocxNavItem.Content
source: Export to DOCX
ar_sa: تصدير إلى DOCX
de_de: Als DOCX exportieren
es_es: Exportar a DOCX
fr_fr: Exporter en DOCX
ja_jp: DOCXにエクスポート
ru_ru: Экспортировать в DOCX
ur_pk: DOCX میں برآمد کریں

# ExportPdfNavItem.Content
source: Export to PDF
ar_sa: تصدير إلى PDF
de_de: Als PDF exportieren
es_es: Exportar a PDF
fr_fr: Exporter en PDF
ja_jp: PDFにエクスポート
ru_ru: Экспортировать в PDF
ur_pk: PDF میں برآمد کریں

# MacroLoad
source: Load Macro
ar_sa: تحميل الماكرو
de_de: Makro laden
es_es: Cargar macro
fr_fr: Charger la macro
ja_jp: マクロを読み込む
ru_ru: Загрузить макрос
ur_pk: میکرو لوڈ کریں

# StatusSavedToOneDrive
source: Saved to OneDrive: {0}
ar_sa: تم الحفظ في OneDrive: {0}
de_de: In OneDrive gespeichert: {0}
es_es: Guardado en OneDrive: {0}
fr_fr: Enregistré dans OneDrive : {0}
ja_jp: OneDriveに保存しました: {0}
ru_ru: Сохранено в OneDrive: {0}
ur_pk: OneDrive میں محفوظ کیا: {0}

# StatusMacroLoaded
source: Macro loaded.
ar_sa: تم تحميل الماكرو.
de_de: Makro geladen.
es_es: Macro cargada.
fr_fr: Macro chargée.
ja_jp: マクロを読み込みました。
ru_ru: Макрос загружен.
ur_pk: میکرو لوڈ ہو گیا۔

# MacroNoCommands
source: No commands recorded. Use Record Macro first.
ar_sa: لم يتم تسجيل أي أوامر. استخدم تسجيل الماكرو أولاً.
de_de: Keine Befehle aufgezeichnet. Verwenden Sie zuerst Makro aufzeichnen.
es_es: No hay comandos grabados. Use Grabar macro primero.
fr_fr: Aucune commande enregistrée. Utilisez d'abord Enregistrer une macro.
ja_jp: 記録されたコマンドがありません。まずマクロの記録を使用してください。
ru_ru: Команды не записаны. Сначала используйте Записать макрос.
ur_pk: کوئی کمانڈ ریکارڈ نہیں ہوئی۔ پہلے میکرو ریکارڈ کریں۔

# OptionsSpellCheck
source: Enable Spell Check
ar_sa: تمكين التدقيق الإملائي
de_de: Rechtschreibprüfung aktivieren
es_es: Habilitar corrección ortográfica
fr_fr: Activer la vérification orthographique
ja_jp: スペルチェックを有効にする
ru_ru: Включить проверку орфографии
ur_pk: ہجے کی جانچ فعال کریں

# StatusSpellCheckDisabled
source: Spell check disabled.
ar_sa: تم تعطيل التدقيق الإملائي.
de_de: Rechtschreibprüfung deaktiviert.
es_es: Corrección ortográfica deshabilitada.
fr_fr: Vérification orthographique désactivée.
ja_jp: スペルチェックが無効になりました。
ru_ru: Проверка орфографии отключена.
ur_pk: ہجے کی جانچ غیر فعال ہو گئی۔

# MacroFilter
source: Macro files
ar_sa: ملفات الماكرو
de_de: Makrodateien
es_es: Archivos de macro
fr_fr: Fichiers macro
ja_jp: マクロファイル
ru_ru: Файлы макросов
ur_pk: میکرو فائلیں

# WindowMenu.Title
source: Window
ar_sa: نافذة
de_de: Fenster
es_es: Ventana
fr_fr: Fenêtre
ja_jp: ウィンドウ
ru_ru: Окно
ur_pk: ونڈو

# NewWindowMenuItem.Text
source: New Window
ar_sa: نافذة جديدة
de_de: Neues Fenster
es_es: Nueva ventana
fr_fr: Nouvelle fenêtre
ja_jp: 新しいウィンドウ
ru_ru: Новое окно
ur_pk: نئی ونڈو

# TemplatesNavItem.Content
source: Templates
ar_sa: القوالب
de_de: Vorlagen
es_es: Plantillas
fr_fr: Modèles
ja_jp: テンプレート
ru_ru: Шаблоны
ur_pk: ٹیمپلیٹس

# BackstageTemplatesDesc
source: Choose a template to start your document with pre-formatted content.
ar_sa: اختر قالبًا لبدء المستند بمحتوى منسق مسبقًا.
de_de: Wählen Sie eine Vorlage, um das Dokument mit vorformatiertem Inhalt zu starten.
es_es: Elige una plantilla para iniciar el documento con contenido preformateado.
fr_fr: Choisissez un modèle pour démarrer votre document avec un contenu préformaté.
ja_jp: テンプレートを選んで、書式設定済みのコンテンツで文書を開始します。
ru_ru: Выберите шаблон для запуска документа с предварительным форматированием.
ur_pk: ایک ٹیمپلیٹ منتخب کریں تاکہ پہلے سے فارمیٹ شدہ مواد کے ساتھ دستاویز شروع کریں۔

# StatusTemplateApplied
source: Template applied: {0}
ar_sa: تم تطبيق القالب: {0}
de_de: Vorlage angewendet: {0}
es_es: Plantilla aplicada: {0}
fr_fr: Modèle appliqué : {0}
ja_jp: テンプレートを適用しました：{0}
ru_ru: Шаблон применён: {0}
ur_pk: ٹیمپلیٹ لاگو کیا: {0}

# BackstageExitDesc
source: Close the application.
ar_sa: أغلق التطبيق.
de_de: Anwendung schließen.
es_es: Cerrar la aplicación.
fr_fr: Fermer l'application.
ja_jp: アプリケーションを閉じます。
ru_ru: Закрыть приложение.
ur_pk: ایپلیکیشن بند کریں۔

# NoHighlightButton.Content
source: No Highlight
ar_sa: بدون تمييز
de_de: Keine Hervorhebung
es_es: Sin resaltado
fr_fr: Aucune surbrillance
ja_jp: 蛍光ペンなし
ru_ru: Без выделения
ur_pk: کوئی ہائی لائٹ نہیں

# FormatMenu.Title
source: Format
ar_sa: تنسيق
es_es: Formato
ja_jp: 書式
ru_ru: Формат
ur_pk: فارمیٹ

# FormatFontMenuItem.Text
source: Font...
ar_sa: خط...
de_de: Schriftart...
es_es: Fuente...
fr_fr: Police...
ja_jp: フォント...
ru_ru: Шрифт...
ur_pk: فونٹ...

# FontDialogTitle
source: Font
ar_sa: خط
de_de: Schriftart
es_es: Fuente
fr_fr: Police
ja_jp: フォント
ru_ru: Шрифт
ur_pk: فونٹ

# FontDialogFamily
source: Font Family
ar_sa: عائلة الخط
de_de: Schriftfamilie
es_es: Familia de fuente
fr_fr: Famille de police
ja_jp: フォント ファミリ
ru_ru: Семейство шрифтов
ur_pk: فونٹ فیملی

# FontDialogSize
source: Size
ar_sa: الحجم
de_de: Größe
es_es: Tamaño
fr_fr: Taille
ja_jp: サイズ
ru_ru: Размер
ur_pk: سائز

# FontDialogStyleHeader
source: Style
ar_sa: النمط
de_de: Stil
es_es: Estilo
ja_jp: スタイル
ru_ru: Стиль
ur_pk: اسٹائل

# FontDialogEffectsHeader
source: Effects
ar_sa: التأثيرات
de_de: Effekte
es_es: Efectos
fr_fr: Effets
ja_jp: 文字飾り
ru_ru: Эффекты
ur_pk: اثرات

# FontDialogColorHeader
source: Color
ar_sa: اللون
de_de: Farbe
fr_fr: Couleur
ja_jp: 色
ru_ru: Цвет
ur_pk: رنگ

# StatusFontApplied
source: Font formatting applied.
ar_sa: تم تطبيق تنسيق الخط.
de_de: Schriftformatierung angewendet.
es_es: Formato de fuente aplicado.
fr_fr: Mise en forme de police appliquée.
ja_jp: フォント書式が適用されました。
ru_ru: Форматирование шрифта применено.
ur_pk: فونٹ فارمیٹنگ لاگو ہوگئی۔

# ProUpsellTitle
source: Upgrade to SmrtPad Pro
ar_sa: الترقية إلى SmrtPad Pro
de_de: Upgrade auf SmrtPad Pro
es_es: Actualiza a SmrtPad Pro
fr_fr: Passez a SmrtPad Pro
ja_jp: SmrtPad Pro にアップグレード
ru_ru: Обновите до SmrtPad Pro
ur_pk: SmrtPad Pro میں اپ گریڈ کریں

# ProUpsellContent
source: Unlock AI-powered features including Smrt Sidebar, summarization, tone rewriting, and semantic search.
ar_sa: افتح ميزات الذكاء الاصطناعي: الشريط الجانبي الذكي والتلخيص وإعادة كتابة النغمة والبحث الدلالي.
de_de: KI-Funktionen freischalten: Smart Sidebar, Zusammenfassung, Ton-Umschreibung und semantische Suche.
es_es: Desbloquea funciones de IA: Smart Sidebar, resumen, cambio de tono y busqueda semantica.
fr_fr: Debloquez les fonctionnalites IA : Smart Sidebar, resume, reecriture de ton et recherche semantique.
ja_jp: AI 機能をロック解除: スマートサイドバー、要約、トーン書き換え、セマンティック検索。
ru_ru: Разблокируйте функции ИИ: умная боковая панель, резюме, изменение тона и семантический поиск.
ur_pk: AI خصوصیات: اسمارٹ سائیڈبار، خلاصہ، لہجے کی تحریر، معنوی تلاش۔

# ProUpsellUpgrade
source: Upgrade
ar_sa: ترقية
es_es: Actualizar
fr_fr: Mettre a jour
ja_jp: アップグレード
ru_ru: Обновить
ur_pk: اپ گریڈ

# ProUpsellDismiss
source: Not now
ar_sa: ليس الآن
de_de: Nicht jetzt
es_es: Ahora no
fr_fr: Pas maintenant
ja_jp: 後で
ru_ru: Не сейчас
ur_pk: ابھی نہیں

# SmartSidebarToggle.Text
source: ✨ Smrt Sidebar
ar_sa: الشريط الجانبي الذكي
de_de: Smart Sidebar
es_es: Smart Sidebar
fr_fr: Smart Sidebar
ja_jp: スマートサイドバー
ru_ru: Умная панель
ur_pk: اسمارٹ سائیڈبار

# SessionRestoreDiscard
source: Discard
ar_sa: تجاهل
de_de: Verwerfen
es_es: Descartar
fr_fr: Ignorer
ja_jp: 破棄
ru_ru: Отменить
ur_pk: ردّ کریں

# CrashTelemetryTitle
source: Help improve SmrtPad
ar_sa: ساعد في تحسين SmrtPad
de_de: SmrtPad verbessern helfen
es_es: Ayuda a mejorar SmrtPad
fr_fr: Aidez à améliorer SmrtPad
ja_jp: SmrtPad の改善にご協力ください
ru_ru: Помогите улучшить SmrtPad
ur_pk: SmrtPad کو بہتر بنانے میں مدد کریں

# CrashTelemetryContent
source: Automatically send anonymous crash reports to help us fix bugs faster. No personal data is collected.
ar_sa: أرسل تقارير الأعطال المجهولة تلقائيًا لمساعدتنا في إصلاح الأخطاء بشكل أسرع. لا يتم جمع أي بيانات شخصية.
de_de: Anonyme Absturzberichte automatisch senden, um Fehler schneller zu beheben. Es werden keine persönlichen Daten erfasst.
es_es: Envía automáticamente informes de fallos anónimos para ayudarnos a corregir errores más rápido. No se recopilan datos personales.
fr_fr: Envoyez automatiquement des rapports de plantage anonymes pour nous aider à corriger les bugs plus vite. Aucune donnée personnelle n'est collectée.
ja_jp: 匿名のクラッシュレポートを自動送信して、バグの修正を迅速化します。個人データは収集されません。
ru_ru: Автоматически отправляйте анонимные отчёты об ошибках, чтобы помочь нам быстрее устранять баги. Личные данные не собираются.
ur_pk: گمنام کریش رپورٹس خودکار طریقے سے بھیجیں تاکہ ہم تیزی سے بگ ٹھیک کر سکیں۔ کوئی ذاتی ڈیٹا اکٹھا نہیں کیا جاتا۔

# CrashTelemetryAccept
source: Yes, send reports
ar_sa: نعم، أرسل التقارير
de_de: Ja, Berichte senden
es_es: Sí, enviar informes
fr_fr: Oui, envoyer les rapports
ja_jp: はい、レポートを送信
ru_ru: Да, отправлять отчёты
ur_pk: ہاں، رپورٹس بھیجیں

# CrashTelemetryDecline
source: No thanks
ar_sa: لا شكرًا
de_de: Nein danke
es_es: No, gracias
fr_fr: Non merci
ja_jp: いいえ、結構です
ru_ru: Нет, спасибо
ur_pk: نہیں شکریہ

# SmartSidebarTitle
source: ✨ Smart Sidebar
ar_sa: ✨ الشريط الجانبي الذكي
de_de: ✨ Intelligente Seitenleiste
es_es: ✨ Panel inteligente
fr_fr: ✨ Barre latérale intelligente
ja_jp: ✨ スマートサイドバー
ru_ru: ✨ Умная боковая панель
ur_pk: ✨ سمارٹ سائڈبار

# SummarizeSectionHeading
source: 📝 SUMMARIZE
ar_sa: 📝 تلخيص
de_de: 📝 ZUSAMMENFASSUNG
es_es: 📝 RESUMIR
fr_fr: 📝 RÉSUMER
ja_jp: 📝 要約
ru_ru: 📝 РЕЗЮМЕ
ur_pk: 📝 خلاصہ

# ToneSectionHeading
source: 🎨 TONE
ar_sa: 🎨 النبرة
de_de: 🎨 TON
es_es: 🎨 TONO
fr_fr: 🎨 TON
ja_jp: 🎨 トーン
ru_ru: 🎨 ТОН
ur_pk: 🎨 لہجہ

# SemanticSectionHeading
source: 🔎 SEMANTIC
ar_sa: 🔎 البحث الدلالي
de_de: 🔎 SEMANTISCH
es_es: 🔎 SEMÁNTICO
fr_fr: 🔎 SÉMANTIQUE
ja_jp: 🔎 セマンティック
ru_ru: 🔎 СЕМАНТИКА
ur_pk: 🔎 معنوی تلاش

# HardwareBadgeNpu
source: ⚡ NPU
ru_ru: ⚡ НПБ

# HardwareBadgeGpu
source: 🖥️ GPU
ru_ru: 🖥️ ГПУ

# HardwareBadgeCpu
source: 🐢 CPU
ru_ru: 🐢 ЦПУ

# InkModeMenuItem
source: ✏️ Ink
ar_sa: ✏️ الحبر
de_de: ✏️ Tinte
es_es: ✏️ Tinta
fr_fr: ✏️ Encre
ja_jp: ✏️ インク
ru_ru: ✏️ Рукопись
ur_pk: ✏️ روشنائی

# DocumentOutlineMenuItem
source: 📋 Document Outline
ar_sa: 📋 مخطط المستند
de_de: 📋 Dokumentgliederung
es_es: 📋 Esquema del documento
fr_fr: 📋 Plan du document
ja_jp: 📋 ドキュメントアウトライン
ru_ru: 📋 Структура документа
ur_pk: 📋 دستاویز کا خاکہ

# EmptyStateMessage
source: Start a new document or open a file
ar_sa: ابدأ مستندًا جديدًا أو افتح ملفًا
de_de: Neues Dokument beginnen oder Datei öffnen
es_es: Empieza un nuevo documento o abre un archivo
fr_fr: Commencez un nouveau document ou ouvrez un fichier
ja_jp: 新しいドキュメントを作成するか、ファイルを開く
ru_ru: Создайте новый документ или откройте файл
ur_pk: نیا دستاویز بنائیں یا کوئی فائل کھولیں

# EmptyStateNewButton.Content
source: New document
ar_sa: مستند جديد
de_de: Neues Dokument
es_es: Nuevo documento
fr_fr: Nouveau document
ja_jp: 新規ドキュメント
ru_ru: Новый документ
ur_pk: نیا دستاویز

# EmptyStateOpenButton.Content
source: Open file…
ar_sa: فتح ملف…
de_de: Datei öffnen…
es_es: Abrir archivo…
fr_fr: Ouvrir un fichier…
ja_jp: ファイルを開く…
ru_ru: Открыть файл…
ur_pk: فائل کھولیں…

# SmartSidebarInitializationPending
source: Checking local AI availability...
ar_sa: جارٍ التحقق من توفر الذكاء الاصطناعي المحلي...
de_de: Lokale KI-Verfügbarkeit wird geprüft...
es_es: Comprobando disponibilidad de IA local...
fr_fr: Vérification de la disponibilité de l'IA locale...
ja_jp: ローカル AI の可用性を確認中...
ru_ru: Проверка доступности локального ИИ...
ur_pk: مقامی AI دستیابی جانچ رہے ہیں...

# SmartSidebarExecutionReady
source: Ready on {0}
ar_sa: جاهز على {0}
de_de: Bereit auf {0}
es_es: Listo en {0}
fr_fr: Prêt sur {0}
ja_jp: {0} で準備完了
ru_ru: Готово на {0}
ur_pk: {0} پر تیار

# SmartSidebarExecutionPackageIdentityRequired
source: AI requires the packaged SmrtPad app to be deployed before it can run.
ar_sa: يتطلب الذكاء الاصطناعي نشر تطبيق SmrtPad المعبأ.
de_de: KI erfordert die Bereitstellung der gepackten SmrtPad-App.
es_es: La IA requiere que la aplicación SmrtPad empaquetada esté implementada.
fr_fr: L'IA nécessite le déploiement de l'application SmrtPad packagée.
ja_jp: AI にはパッケージ済みの SmrtPad アプリの展開が必要です。
ru_ru: ИИ требует развёртывания упакованного приложения SmrtPad.
ur_pk: AI کے لیے پیکیج کردہ SmrtPad ایپ کی تعیناتی ضروری ہے۔

# SmartSidebarExecutionUnsupported
source: AI is unavailable on this device. Phi Silica requires a supported Copilot+ PC and Foundry Local GPU acceleration was not available.
ar_sa: الذكاء الاصطناعي غير متاح على هذا الجهاز.
de_de: KI ist auf diesem Gerät nicht verfügbar.
es_es: La IA no está disponible en este dispositivo.
fr_fr: L'IA n'est pas disponible sur cet appareil.
ja_jp: このデバイスでは AI を使用できません。
ru_ru: ИИ недоступен на этом устройстве.
ur_pk: AI اس ڈیوائس پر دستیاب نہیں ہے۔

# SmartSidebarExecutionUnavailable
source: AI is currently unavailable. Try reopening the sidebar after deployment and model setup complete.
ar_sa: الذكاء الاصطناعي غير متاح حالياً.
de_de: KI ist derzeit nicht verfügbar.
es_es: La IA no está disponible en este momento.
fr_fr: L'IA est actuellement indisponible.
ja_jp: AI は現在利用できません。
ru_ru: ИИ в настоящее время недоступен.
ur_pk: AI ابھی دستیاب نہیں ہے۔

# SmartSidebarExecutionTimedOut
source: AI initialization timed out. Try reopening the sidebar to retry.
de_de: KI-Initialisierung hat das Zeitlimit überschritten. Öffne die Seitenleiste erneut, um es nochmals zu versuchen.
es_es: Se agotó el tiempo de inicialización de la IA. Vuelve a abrir el panel lateral para intentarlo de nuevo.
fr_fr: L'initialisation de l'IA a expiré. Rouvrez le panneau latéral pour réessayer.
ja_jp: AI の初期化はタイムアウトしました。サイドバーを再開してもう一度お試しください。
ru_ru: Инициализация ИИ превысила время ожидания. Попробуйте снова открыть боковую панель.

# SmartSidebarResponsibleAiNotice
source: AI suggestions can be inaccurate or incomplete. Review generated text before using it in your document.
ar_sa: قد تكون اقتراحات الذكاء الاصطناعي غير دقيقة. يُرجى مراجعة النص المُنشأ قبل استخدامه.
de_de: KI-Vorschläge können ungenau sein. Bitte prüfen Sie den generierten Text vor der Verwendung.
es_es: Las sugerencias de IA pueden ser inexactas. Revise el texto generado antes de usarlo.
fr_fr: Les suggestions de l'IA peuvent être inexactes. Vérifiez le texte généré avant de l'utiliser.
ja_jp: AI の提案は不正確な場合があります。ドキュメントで使用する前に生成されたテキストを確認してください。
ru_ru: Предложения ИИ могут быть неточными. Проверьте сгенерированный текст перед использованием.
ur_pk: AI کی تجاویز غلط ہو سکتی ہیں۔ دستاویز میں استعمال کرنے سے پہلے تیار کردہ متن کا جائزہ لیں۔

# SmartSidebarApplyGeneratedText
source: Apply to document
ar_sa: تطبيق على المستند
de_de: In Dokument übernehmen
es_es: Aplicar al documento
fr_fr: Appliquer au document
ja_jp: ドキュメントに適用
ru_ru: Применить к документу
ur_pk: دستاویز پر لاگو کریں
